cases/1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rho*phi,U)  	Gauss SFCD;
    div(phi,alpha)  	Gauss vanLeer01;
    div(phirb,alpha)	Gauss vanLeer01;
    div(phi,Yi)    Gauss vanLeer01;
    div(phiH,Yi)   Gauss linear;
    div(phirb,Yi)  Gauss vanLeer01;
    div(phiD,alpha) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    limitedScheme   localMin;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
